; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-4-9)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city5)
	(= (capacity plane1) 7579)
	(= (fuel plane1) 2340)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 8)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 2)
	(at plane2 city5)
	(= (capacity plane2) 8887)
	(= (fuel plane2) 3715)
	(= (slow-burn plane2) 4)
	(= (fast-burn plane2) 13)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 1)
	(at plane3 city0)
	(= (capacity plane3) 5305)
	(= (fuel plane3) 1035)
	(= (slow-burn plane3) 2)
	(= (fast-burn plane3) 4)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 10)
	(at plane4 city4)
	(= (capacity plane4) 8826)
	(= (fuel plane4) 2997)
	(= (slow-burn plane4) 3)
	(= (fast-burn plane4) 6)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 8)
	(at person1 city0)
	(at person2 city1)
	(at person3 city2)
	(at person4 city3)
	(at person5 city4)
	(at person6 city5)
	(at person7 city4)
	(at person8 city2)
	(at person9 city2)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 718)
	(= (distance city0 city2) 741)
	(= (distance city0 city3) 871)
	(= (distance city0 city4) 576)
	(= (distance city0 city5) 685)
	(= (distance city1 city0) 718)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 973)
	(= (distance city1 city3) 896)
	(= (distance city1 city4) 841)
	(= (distance city1 city5) 813)
	(= (distance city2 city0) 741)
	(= (distance city2 city1) 973)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 576)
	(= (distance city2 city4) 885)
	(= (distance city2 city5) 652)
	(= (distance city3 city0) 871)
	(= (distance city3 city1) 896)
	(= (distance city3 city2) 576)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 921)
	(= (distance city3 city5) 801)
	(= (distance city4 city0) 576)
	(= (distance city4 city1) 841)
	(= (distance city4 city2) 885)
	(= (distance city4 city3) 921)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 899)
	(= (distance city5 city0) 685)
	(= (distance city5 city1) 813)
	(= (distance city5 city2) 652)
	(= (distance city5 city3) 801)
	(= (distance city5 city4) 899)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city5)
	(at person2 city3)
	(at person3 city3)
	(at person5 city5)
	(at person6 city0)
	(at person7 city4)
	(at person8 city0)
	(at person9 city5)
	))

(:metric minimize (+ (* 2 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (board person6 plane1 city5)
   deleted: (at person6 city5)
   added: (in person6 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 8
2. (board person5 plane4 city4)
   deleted: (at person5 city4)
   added: (in person5 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 1 of 8
3. (fly plane4 city4 city5)
   deleted: (at plane4 city4)
   added: (at plane4 city5)
   changed: (total-fuel-used) from 0 to 2697, (fuel plane4) from 2997 to 300
   goals met: 1 of 8
4. (debark person5 plane4 city5)
   deleted: (in person5 plane4)
   added: (at person5 city5)
   changed: (onboard plane4) from 1 to 0
   goals met: 2 of 8
5. (fly plane1 city5 city0)
   deleted: (at plane1 city5)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 2697 to 4752, (fuel plane1) from 2340 to 285
   goals met: 2 of 8
6. (board person1 plane3 city0)
   deleted: (at person1 city0)
   added: (in person1 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 2 of 8
7. (debark person6 plane1 city0)
   deleted: (in person6 plane1)
   added: (at person6 city0)
   changed: (onboard plane1) from 1 to 0
   goals met: 3 of 8
8. (refuel plane3 city0)
   changed: (fuel plane3) from 1035 to 5305
   goals met: 3 of 8
9. (fly plane2 city5 city3)
   deleted: (at plane2 city5)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 4752 to 7956, (fuel plane2) from 3715 to 511
   goals met: 3 of 8
10. (fly plane3 city0 city1)
   deleted: (at plane3 city0)
   added: (at plane3 city1)
   changed: (total-fuel-used) from 7956 to 9392, (fuel plane3) from 5305 to 3869
   goals met: 3 of 8
11. (board person2 plane3 city1)
   deleted: (at person2 city1)
   added: (in person2 plane3)
   changed: (onboard plane3) from 1 to 2
   goals met: 3 of 8
12. (fly plane3 city1 city2)
   deleted: (at plane3 city1)
   added: (at plane3 city2)
   changed: (total-fuel-used) from 9392 to 11338, (fuel plane3) from 3869 to 1923
   goals met: 3 of 8
13. (board person3 plane3 city2)
   deleted: (at person3 city2)
   added: (in person3 plane3)
   changed: (onboard plane3) from 2 to 3
   goals met: 3 of 8
14. (board person8 plane3 city2)
   deleted: (at person8 city2)
   added: (in person8 plane3)
   changed: (onboard plane3) from 3 to 4
   goals met: 3 of 8
15. (fly plane3 city2 city3)
   deleted: (at plane3 city2)
   added: (at plane3 city3)
   changed: (total-fuel-used) from 11338 to 12490, (fuel plane3) from 1923 to 771
   goals met: 3 of 8
16. (refuel plane3 city3)
   changed: (fuel plane3) from 771 to 5305
   goals met: 3 of 8
17. (debark person2 plane3 city3)
   deleted: (in person2 plane3)
   added: (at person2 city3)
   changed: (onboard plane3) from 4 to 3
   goals met: 4 of 8
18. (debark person3 plane3 city3)
   deleted: (in person3 plane3)
   added: (at person3 city3)
   changed: (onboard plane3) from 3 to 2
   goals met: 5 of 8
19. (fly plane3 city3 city5)
   deleted: (at plane3 city3)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 12490 to 14092, (fuel plane3) from 5305 to 3703
   goals met: 5 of 8
20. (debark person1 plane3 city5)
   deleted: (in person1 plane3)
   added: (at person1 city5)
   changed: (onboard plane3) from 2 to 1
   goals met: 6 of 8
21. (fly plane3 city5 city0)
   deleted: (at plane3 city5)
   added: (at plane3 city0)
   changed: (total-fuel-used) from 14092 to 15462, (fuel plane3) from 3703 to 2333
   goals met: 6 of 8
22. (debark person8 plane3 city0)
   deleted: (in person8 plane3)
   added: (at person8 city0)
   changed: (onboard plane3) from 1 to 0
   goals met: 7 of 8
23. (fly plane3 city0 city5)
   deleted: (at plane3 city0)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 15462 to 16832, (fuel plane3) from 2333 to 963
   goals met: 7 of 8
24. (refuel plane3 city5)
   changed: (fuel plane3) from 963 to 5305
   goals met: 7 of 8
25. (zoom plane3 city5 city2)
   deleted: (at plane3 city5)
   added: (at plane3 city2)
   changed: (total-fuel-used) from 16832 to 19440, (fuel plane3) from 5305 to 2697
   goals met: 7 of 8
26. (board person9 plane3 city2)
   deleted: (at person9 city2)
   added: (in person9 plane3)
   changed: (onboard plane3) from 0 to 1
   goals met: 7 of 8
27. (fly plane3 city2 city5)
   deleted: (at plane3 city2)
   added: (at plane3 city5)
   changed: (total-fuel-used) from 19440 to 20744, (fuel plane3) from 2697 to 1393
   goals met: 7 of 8
28. (debark person9 plane3 city5)
   deleted: (in person9 plane3)
   added: (at person9 city5)
   changed: (onboard plane3) from 1 to 0
   goals met: 8 of 8
